# Последовательность чисел 1

# Даны два целых числа m и n (m≤n). Напишите программу, которая выводит все числа от m до n включительно.
# Формат входных данных
# На вход программе подаются два целых числа m и n, каждое на отдельной строке.
# Формат выходных данных
# Программа должна вывести числа в соответствии с условием задачи.

for i in range(int(input()), int(input()) + 1):
    print(i)