# На вход программе подается натуральное число n. Напишите программу, которая вычисляет n!.
# Входные данные
# На вход программе подается натуральное число n, (n ≤ 12).
# Выходные данные
# Программа должна вывести единственное число в соответствии с условием задачи.
# Примечание. Факториалом натурального числа nn, называется произведение всех натуральных чисел от 11 до nn, то есть
# n!=1⋅2⋅3⋅…⋅n

from math import factorial
print(factorial(int(input())))
