# Напишите программу, которая считывает целое положительное число n,n∈[1;9] и выводит значение числа 
# Формат входных данных
# На вход программе подаётся одно целое положительное число n,n∈[1;9].
# Формат выходных данных
# Программа должна вывести число 
# n+nn+nnn

n = int(input())
print(n+11*n+111*n)