# Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной последовательности, каждую на отдельной строчке.
# Формат входных данных
# На вход программе подается три строки, каждая на отдельной строке.
# Формат выходных данных
# Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.
# Примечание. Используйте 3 переменные для сохранения введённых строк текста.

text1, text2, text3 = input(), input(), input()
print(text3)
print(text2)
print(text1)